quickcheck.org
#+auto_tangle: t
* quickcheck.el
:LOGBOOK:
CLOCK: [2025-07-19 Sat 13:43]--[2025-07-19 Sat 13:45] =>  0:02
:END:
#+BEGIN: clocktable :scope subtree 
#+CAPTION: Clock summary at [2025-06-23 Mon 00:40]
| Headline                    | Time    |      |
|-----------------------------+---------+------|
| *Total time*                | *19:25* |      |
|-----------------------------+---------+------|
| quickcheck.el               | 19:25   |      |
| \_  Testing Utilities       |         | 0:10 |
| \_  generics for quickcheck |         | 3:06 |
| \_  random.hs               |         | 7:54 |
| \_  gen.hs                  |         | 4:42 |
| \_  Cancelled               |         | 3:33 |
#+END:
** header
#+begin_src elisp :tangle yes
;;; quickcheck.el --- quickcheck: quickcheck clone  -*- lexical-binding: t; no-byte-compile: t -*-

  
;; Author: Earl Chase
;; Maintainer: Earl Chase
;; Version: 0.0
;; Keywords: testing

;; This file is NOT part of GNU Emacs.

;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation; either version 3, or (at your option)
;; any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with GNU Emacs; see the file COPYING.  If not, write to the
;; Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor,
;; Boston, MA 02110-1301, USA.

;;; Commentary:

;; This is a quickcheck clone.

;;; Code:
  
#+END_SRC
** file organization
:LOGBOOK:
CLOCK: [2025-07-19 Sat 13:45]--[2025-07-19 Sat 13:53] =>  0:08
:END:

** imports
#+begin_src elisp :tangle yes

    (require 'eieio)
    (require 'cl-lib)
    (require 'calc-comb)
    (require 'range)
    (require 'dash)
    (require 's)

#+END_SRC
** DONE create a .dir-locals.el
CLOSED: [2025-07-25 Fri 08:37]
:LOGBOOK:
CLOCK: [2025-07-25 Fri 08:35]--[2025-07-25 Fri 08:37] =>  0:02
:END:
** TODO setup cask
:LOGBOOK:
CLOCK: [2025-07-28 Mon 04:37]
CLOCK: [2025-07-28 Mon 03:06]--[2025-07-28 Mon 03:31] =>  0:25
CLOCK: [2025-07-28 Mon 01:27]--[2025-07-28 Mon 01:49] =>  0:22
CLOCK: [2025-07-27 Sun 22:30]--[2025-07-27 Sun 22:51] =>  0:21
:END:
** constants
#+begin_src elisp :tangle yes
  (defconst DEFAULTRANDOMNUMBERRANGE
    (list 1 255)    
    "default random number range")
  (defconst THOUSAND
    (float 1000)
    "Float creator")
  (defconst SIZE
    30
    "Size for generators")
  
#+end_src

#+RESULTS:
: 0.1

** miscellaneous aliases
#+begin_src elisp :tangle yes
  (defalias '2+ (apply-partially #'+ 2))
  (defalias 'print (apply-partially #'message "%s"))
#+end_src

** Utilities

#+RESULTS:

*** DONE Comparison functions aliases
CLOSED: [2025-07-08 Tue 23:42]
:LOGBOOK:
CLOCK: [2025-07-04 Fri 04:18]--[2025-07-04 Fri 04:20] =>  0:02
:END:
#+begin_src elisp :tangle yes

  (defalias 'not-equal #'/=)
  (defalias 'less-than #'<)
  (defalias 'less-than-or-equal #'<=)
  (defalias 'greater-than #'>)
  (defalias 'greater-than-or-equal #'>=)
  (defalias 'greater-than-or-equal-one (-rpartial #'>= 1))
  (defalias 'equal-zero (apply-partially #'eql 0))
  (defalias 'equal-one (apply-partially #'eql 0))

#+end_src

#+RESULTS:

*** calc
**** aliases
#+begin_src elisp :tangle yes
  (defalias 'calcFunc-random-255 (apply-partially #'calcFunc-random 255))
#+end_src
**** TODO extensions
- [[id:eca499ba-5738-4a7f-a759-a853d11fbb78][aliases]]
***** DONE cons-vec
CLOSED: [2025-07-23 Wed 05:14]
#+begin_src elisp :tangle yes
  (defalias 'cons-vec (apply-partially #'cons 'vec))
#+end_src
***** DONE shuffle-list
#+begin_src elisp :tangle yes
(defalias 'shuffle-list (-compose #'cdr (-applify #'math-shuffle-list) (-juxt #'seq-length #'seq-length #'cons-vec)))
#+end_src

***** DONE convert-calc-value-into-lisp
CLOSED: [2025-06-16 Mon 08:45]
#+begin_src elisp :tangle yes
  (defun convert-calc-value-into-lisp (calc-value)
    (read (math-format-value calc-value)))
#+end_src

*** dash
**** aliases
:PROPERTIES:
:ID:       eca499ba-5738-4a7f-a759-a853d11fbb78
:END:
:LOGBOOK:
CLOCK: [2025-07-24 Thu 07:38]--[2025-07-24 Thu 07:40] =>  0:02
CLOCK: [2025-07-24 Thu 04:42]--[2025-07-24 Thu 04:43] =>  0:01
CLOCK: [2025-07-22 Tue 20:33]--[2025-07-22 Tue 20:33] =>  0:00
CLOCK: [2025-07-07 Mon 14:30]--[2025-07-07 Mon 14:35] =>  0:05
CLOCK: [2025-07-05 Sat 08:49]--[2025-07-05 Sat 09:16] =>  0:27
CLOCK: [2025-07-05 Sat 08:40]--[2025-07-05 Sat 08:46] =>  0:06
CLOCK: [2025-07-05 Sat 08:34]--[2025-07-05 Sat 08:35] =>  0:01
CLOCK: [2025-07-04 Fri 06:08]--[2025-07-04 Fri 06:10] =>  0:02
CLOCK: [2025-07-04 Fri 04:23]--[2025-07-04 Fri 04:33] =>  0:10
CLOCK: [2025-07-04 Fri 03:14]--[2025-07-04 Fri 03:16] =>  0:02
CLOCK: [2025-07-03 Thu 17:35]--[2025-07-03 Thu 17:49] =>  0:14
:END:
#+begin_src elisp :tangle yes
  (defalias '-first-and-last-item  (-juxt #'-first-item #'-last-item))
  (defalias '-iterate-plus-one  (-partial #'-iterate #'1+))


  (defalias '-applify-rpartial (-applify #'-rpartial))
  (defalias '-applify-partial (-applify #'-partial))

  (defalias '-applify-subtract (-applify #'-))
  (defalias '-applify-iterate-plus-one  (-applify #'-iterate-plus-one))
    
  (defalias '-applify-zip  (-applify #'-zip))
  (defalias '-applify-cons  (-applify #'cons))
  (defalias '-applify-mapcar  (-applify #'mapcar))
  (defalias '-applify-divide (-applify #'/))
  (defalias '-applify-cl-subsetp (-applify #'cl-subsetp))


  (defalias 'divide-by-THOUSAND   (-rpartial #'/ THOUSAND))
  (defalias 'divide-array-values-by-max-array-value (-compose #'-applify-mapcar (-juxt (-compose #'-applify-rpartial (apply-partially #'list #'/) #'float #'1+ #'-max) #'identity)))  
  (defalias 'identity-and-seq-length (-juxt #'identity #'seq-length))


#+end_src

#+RESULTS:
: 3
**** extensions
***** DONE times
#+BEGIN_SRC emacs-lisp :tangle yes
  (defun times (function n)
    (cdr (-iterate function nil (1+ n))))

#+END_SRC

***** DONE times-no-args
#+BEGIN_SRC emacs-lisp :tangle yes
  (defun times-no-args (function n)
    (cdr (-iterate (lambda (_) (funcall function)) nil (1+ n))))

#+END_SRC

*** math
**** DONE range-member-exclusive-p
CLOSED: [2025-07-03 Thu 06:54]
:LOGBOOK:
CLOCK: [2025-07-03 Thu 06:52]--[2025-07-03 Thu 06:54] =>  0:02
CLOCK: [2025-07-03 Thu 06:44]--[2025-07-03 Thu 06:44] =>  0:00
CLOCK: [2025-07-03 Thu 06:05]--[2025-07-03 Thu 06:19] =>  0:14
CLOCK: [2025-07-03 Thu 05:32]--[2025-07-03 Thu 06:02] =>  0:30
CLOCK: [2025-07-03 Thu 04:55]--[2025-07-03 Thu 05:23] =>  0:28
:END:
#+begin_src elisp :tangle yes
  (cl-defun range-member-exclusive-p ((range-min range-max) number)
    (and (greater-than-or-equal number range-min) (less-than number range-max)))
#+end_src

#+RESULTS:
: t
***** DONE range-member-exclusive-p aliases
CLOSED: [2025-07-21 Mon 18:02]
:PROPERTIES:
:ID:       6db694a7-b2a6-4a7f-b740-dc8acb34be6b
:END:
:LOGBOOK:
CLOCK: [2025-07-21 Mon 17:55]--[2025-07-21 Mon 17:58] =>  0:03
CLOCK: [2025-07-21 Mon 17:49]--[2025-07-21 Mon 17:49] =>  0:00
CLOCK: [2025-07-19 Sat 14:57]--[2025-07-19 Sat 15:10] =>  0:13
:END:
- [[id:b4a50ccc-58c0-4987-97b4-24962bafc837][seq-random-chunk-length]]
#+begin_src elisp :tangle yes
  (defalias 'between-one-and-255 (apply-partially #'range-member-exclusive-p (list 1 255)))
  (defalias 'between-zero-and-one (apply-partially #'range-member-exclusive-p (list 0 1)))
  (defalias 'between-one-and-? (-compose #'-applify-partial (-partial #'list #'range-member-exclusive-p) (-partial #'list 1)))
#+end_src

**** DONE non-zero-bounded-modular-addition
#+begin_src elisp :tangle yes
  (cl-defun non-zero-bounded-modular-addition ((range-min range-max) increase current-number)
    (when (greater-than-or-equal range-min range-max)
      (user-error "range-min %d is not less than range-max %d" range-min range-max))
    (let* ((range-size (- range-max range-min))
  	 (adjusted-increase (mod increase range-size))
  	 (current-number-index (max (- current-number range-min) 0))
  	 (adjusted-current-number-index (mod current-number-index range-size))
  	 (new-number-index (mod (+ adjusted-current-number-index adjusted-increase) range-size))
  	 (new-number (+ range-min new-number-index)))
    new-number))  
#+end_src
**** DONE range-size
CLOSED: [2025-07-03 Thu 06:51]
:LOGBOOK:
CLOCK: [2025-07-03 Thu 06:48]--[2025-07-03 Thu 06:51] =>  0:03
:END:
#+begin_src elisp :tangle yes
  (defalias 'range-size (-compose #'-applify-subtract #'reverse))
#+end_src

**** DONE scale-float-to-range
#+begin_src elisp :tangle yes
  (cl-defun scale-float-to-range ((min max) float-to-scale)
    ;; Float must be between 0 and 1
    (when (greater-than-or-equal min max)
      (error "min must be less than max"))
    (let* ((min-ceiled (ceiling min))
  	 (max-floored (floor max))
  	 (min-max (- max-floored min-ceiled))
  	 (float-times-min-max (* float-to-scale min-max))
  	 (plus-min-ceiled (+ float-times-min-max min-ceiled)))
    (floor plus-min-ceiled)))

#+END_SRC






*** generic max
*** random data generators
**** DONE random-float-between-0-and-1
CLOSED: [2025-06-22 Sun 16:23]
#+begin_src elisp :tangle yes
  (defun random-float-between-0-and-1 ()    
    (funcall (-compose #'convert-calc-value-into-lisp #'math-random-float)))
#+end_src

**** DONE random-integer-in-range
CLOSED: [2025-06-30 Mon 21:19]
:LOGBOOK:
CLOCK: [2025-07-07 Mon 22:13]--[2025-07-07 Mon 22:17] =>  0:04
CLOCK: [2025-06-30 Mon 21:11]--[2025-06-30 Mon 21:19] =>  0:08
:END:
#+begin_src elisp :tangle yes
  (cl-defun random-integer-in-range ((min max))
    (if (eql min max)
        min
      (funcall (-compose (apply-partially #'scale-float-to-range (list min max))  #'random-float-between-0-and-1))))
  
#+end_src
**** DONE random-integer-in-range-255
CLOSED: [2025-07-01 Tue 02:04]
:LOGBOOK:
CLOCK: [2025-07-01 Tue 02:01]--[2025-07-01 Tue 02:04] =>  0:03
:END:
#+begin_src elisp :tangle yes
 (defalias 'random-integer-in-range-255 (apply-partially #'random-integer-in-range DEFAULTRANDOMNUMBERRANGE))  
#+end_src

#+RESULTS:
: 1
**** DONE random-integer-in-range-from-one
CLOSED: [2025-07-21 Mon 19:19]
:LOGBOOK:
CLOCK: [2025-07-21 Mon 19:15]--[2025-07-21 Mon 19:16] =>  0:01
CLOCK: [2025-07-21 Mon 18:07]--[2025-07-21 Mon 18:07] =>  0:00
CLOCK: [2025-07-19 Sat 13:25]--[2025-07-19 Sat 13:29] =>  0:04
:END:
#+begin_src elisp :tangle yes
 (defalias 'random-integer-in-range-from-one (-compose #'random-integer-in-range (apply-partially #'list 1)))  
#+end_src
