quickcheck.el
;;; quickcheck.el --- quickcheck: quickcheck clone  -*- lexical-binding: t; no-byte-compile: t -*-

  
;; Author: Earl Chase
;; Maintainer: Earl Chase
;; Version: 0.0
;; Keywords: testing

;; This file is NOT part of GNU Emacs.

;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation; either version 3, or (at your option)
;; any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with GNU Emacs; see the file COPYING.  If not, write to the
;; Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor,
;; Boston, MA 02110-1301, USA.

;;; Commentary:

;; This is a quickcheck clone.

;;; Code:

(require 'eieio)
(require 'cl-lib)
(require 'calc-comb)
(require 'range)
(require 'dash)
(require 's)

(defconst DEFAULTRANDOMNUMBERRANGE
  (list 1 255)    
  "default random number range")
(defconst THOUSAND
  (float 1000)
  "Float creator")
(defconst SIZE
  30
  "Size for generators")

(defalias '2+ (apply-partially #'+ 2))
(defalias 'print (apply-partially #'message "%s"))

(defalias 'not-equal #'/=)
(defalias 'less-than #'<)
(defalias 'less-than-or-equal #'<=)
(defalias 'greater-than #'>)
(defalias 'greater-than-or-equal #'>=)
(defalias 'greater-than-or-equal-one (-rpartial #'>= 1))
(defalias 'equal-zero (apply-partially #'eql 0))
(defalias 'equal-one (apply-partially #'eql 0))

(defalias 'calcFunc-random-255 (apply-partially #'calcFunc-random 255))

(defalias 'cons-vec (apply-partially #'cons 'vec))

(defalias 'shuffle-list (-compose #'cdr (-applify #'math-shuffle-list) (-juxt #'seq-length #'seq-length #'cons-vec)))

(defun convert-calc-value-into-lisp (calc-value)
  (read (math-format-value calc-value)))

(defalias '-first-and-last-item  (-juxt #'-first-item #'-last-item))
(defalias '-iterate-plus-one  (-partial #'-iterate #'1+))


(defalias '-applify-rpartial (-applify #'-rpartial))
(defalias '-applify-partial (-applify #'-partial))

(defalias '-applify-subtract (-applify #'-))
(defalias '-applify-iterate-plus-one  (-applify #'-iterate-plus-one))
  
(defalias '-applify-zip  (-applify #'-zip))
(defalias '-applify-cons  (-applify #'cons))
(defalias '-applify-mapcar  (-applify #'mapcar))
(defalias '-applify-divide (-applify #'/))
(defalias '-applify-cl-subsetp (-applify #'cl-subsetp))


(defalias 'divide-by-THOUSAND   (-rpartial #'/ THOUSAND))
(defalias 'divide-array-values-by-max-array-value (-compose #'-applify-mapcar (-juxt (-compose #'-applify-rpartial (apply-partially #'list #'/) #'float #'1+ #'-max) #'identity)))  
(defalias 'identity-and-seq-length (-juxt #'identity #'seq-length))

(defun times (function n)
  (cdr (-iterate function nil (1+ n))))

(defun times-no-args (function n)
  (cdr (-iterate (lambda (_) (funcall function)) nil (1+ n))))

(cl-defun range-member-exclusive-p ((range-min range-max) number)
  (and (greater-than-or-equal number range-min) (less-than number range-max)))

(defalias 'between-one-and-255 (apply-partially #'range-member-exclusive-p (list 1 255)))
(defalias 'between-zero-and-one (apply-partially #'range-member-exclusive-p (list 0 1)))
(defalias 'between-one-and-? (-compose #'-applify-partial (-partial #'list #'range-member-exclusive-p) (-partial #'list 1)))

(cl-defun non-zero-bounded-modular-addition ((range-min range-max) increase current-number)
  (when (greater-than-or-equal range-min range-max)
    (user-error "range-min %d is not less than range-max %d" range-min range-max))
  (let* ((range-size (- range-max range-min))
	 (adjusted-increase (mod increase range-size))
	 (current-number-index (max (- current-number range-min) 0))
	 (adjusted-current-number-index (mod current-number-index range-size))
	 (new-number-index (mod (+ adjusted-current-number-index adjusted-increase) range-size))
	 (new-number (+ range-min new-number-index)))
  new-number))

(defalias 'range-size (-compose #'-applify-subtract #'reverse))

(cl-defun scale-float-to-range ((min max) float-to-scale)
  ;; Float must be between 0 and 1
  (when (greater-than-or-equal min max)
    (error "min must be less than max"))
  (let* ((min-ceiled (ceiling min))
	 (max-floored (floor max))
	 (min-max (- max-floored min-ceiled))
	 (float-times-min-max (* float-to-scale min-max))
	 (plus-min-ceiled (+ float-times-min-max min-ceiled)))
  (floor plus-min-ceiled)))

(defun random-float-between-0-and-1 ()    
  (funcall (-compose #'convert-calc-value-into-lisp #'math-random-float)))

(cl-defun random-integer-in-range ((min max))
  (if (eql min max)
      min
    (funcall (-compose (apply-partially #'scale-float-to-range (list min max))  #'random-float-between-0-and-1))))

(defalias 'random-integer-in-range-255 (apply-partially #'random-integer-in-range DEFAULTRANDOMNUMBERRANGE))

(defalias 'random-integer-in-range-from-one (-compose #'random-integer-in-range (apply-partially #'list 1)))

(defalias 'random-con-from-array (-compose #'-applify-cons #'seq-two-random-values))
