quickcheck.org
**** DONE random-con-from-array
#+begin_src elisp :tangle yes
(defalias 'random-con-from-array (-compose #'-applify-cons #'seq-two-random-values))
#+end_src
**** DONE random-integer-list
CLOSED: [2025-07-01 Tue 05:21]
:LOGBOOK:
CLOCK: [2025-07-01 Tue 05:13]--[2025-07-01 Tue 05:21] =>  0:08
CLOCK: [2025-07-01 Tue 05:08]--[2025-07-01 Tue 05:09] =>  0:01
CLOCK: [2025-07-01 Tue 02:04]--[2025-07-01 Tue 02:15] =>  0:11
CLOCK: [2025-07-01 Tue 01:59]--[2025-07-01 Tue 02:01] =>  0:02
:END:
#+begin_src elisp :tangle yes
  (defun random-integer-list (length)    
    (funcall (-compose #'seq-shuffle #'-iterate-plus-one) (math-random-three-digit-number) length))  
  (defalias 'random-integer-list-in-range-255 (-compose #'random-integer-list #'random-integer-in-range-255))
#+end_src

**** DONE random-integer-range
CLOSED: [2025-07-03 Thu 06:51]
:LOGBOOK:
CLOCK: [2025-07-03 Thu 06:44]--[2025-07-03 Thu 06:48] =>  0:04
CLOCK: [2025-06-30 Mon 21:02]--[2025-06-30 Mon 21:08] =>  0:06
CLOCK: [2025-06-22 Sun 22:24]--[2025-06-22 Sun 22:34] =>  0:10
:END:
#+begin_src elisp :tangle yes
  (defun random-integer-range (length)    
    (funcall (-juxt #'identity (apply-partially #'+ length))
  	   (math-random-three-digit-number)))  
#+end_src

**** DONE divide-by-random-value
CLOSED: [2025-07-07 Mon 19:17]
:LOGBOOK:
CLOCK: [2025-07-07 Mon 19:13]--[2025-07-07 Mon 19:16] =>  0:03
CLOCK: [2025-07-07 Mon 17:18]--[2025-07-07 Mon 17:45] =>  0:27
CLOCK: [2025-07-07 Mon 17:18]--[2025-07-07 Mon 17:18] =>  0:00
:END:
#+begin_src elisp :tangle yes
  (defalias 'divide-by-random-value (funcall (-compose #'-applify-rpartial (apply-partially #'list #'/) (-compose #'float #'random-integer-in-range-255))))  
#+end_src
**** DONE divide-array-values-by-random-value
CLOSED: [2025-07-07 Mon 19:27]
:LOGBOOK:
CLOCK: [2025-07-07 Mon 19:17]--[2025-07-07 Mon 19:18] =>  0:01
:END:
#+begin_src elisp :tangle yes
  (defalias 'divide-array-values-by-random-value (apply-partially #'mapcar #'divide-by-random-value))
#+end_src

*** seq
**** DONE aliases
CLOSED: [2025-07-25 Fri 00:35]
:LOGBOOK:
CLOCK: [2025-07-25 Fri 00:35]--[2025-07-25 Fri 00:35] =>  0:00
CLOCK: [2025-07-25 Fri 00:33]--[2025-07-25 Fri 00:33] =>  0:00
CLOCK: [2025-07-25 Fri 00:31]--[2025-07-25 Fri 00:32] =>  0:01
CLOCK: [2025-07-24 Thu 04:43]--[2025-07-24 Thu 04:45] =>  0:02
CLOCK: [2025-07-25 Fri 00:33]--[2025-07-25 Fri 00:34] =>  0:01
CLOCK: [2025-07-25 Fri 00:19]--[2025-07-25 Fri 00:23] =>  0:04
CLOCK: [2025-07-19 Sat 13:08]--[2025-07-19 Sat 13:16] =>  0:08
CLOCK: [2025-07-11 Fri 04:25]--[2025-07-11 Fri 04:26] =>  0:01
CLOCK: [2025-07-04 Fri 04:20]--[2025-07-04 Fri 04:20] =>  0:00
CLOCK: [2025-07-04 Fri 04:18]--[2025-07-04 Fri 04:18] =>  0:00
CLOCK: [2025-07-04 Fri 04:18]--[2025-07-04 Fri 04:18] =>  0:00
CLOCK: [2025-07-01 Tue 05:09]--[2025-07-01 Tue 05:13] =>  0:04
:END:
#+begin_src elisp :tangle yes
  (defalias 'seq-count-integers (apply-partially #'seq-count #'integerp))
  (defalias 'seq-count-floats (apply-partially #'seq-count #'floatp))
  (defalias 'seq-count-strings (apply-partially #'seq-count #'stringp))  
  (defalias 'seq-count-cons (apply-partially #'seq-count #'consp))

  (defalias 'seq-count-between-zero-and-one (apply-partially #'seq-count #'between-zero-and-one))
  (defalias 'seq-count-greater-than-or-equal-one (apply-partially #'seq-count #'greater-than-or-equal-one))

  (defalias 'seq-map-add-one (apply-partially #'seq-map #'1+))
  (defalias 'seq-map-length (apply-partially #'seq-map #'seq-length))
  (defalias 'seq-sum-map-length (-compose #'-sum #'seq-map-length))

  (defalias 'seq-map-seq--into-list (apply-partially #'seq-map #'seq--into-list))
  (defalias 'seq-max-plus-one (-compose #'1+ #'seq-max))
  (defalias 'seq-max-plus-one-and-random-chunk-length (-juxt #'seq-max-plus-one  #'seq-random-chunk-length))  

#+end_src

#+RESULTS:
: 100

**** TODO extensions
***** DONE seq-take-right
CLOSED: [2025-07-21 Mon 19:30]
:LOGBOOK:
CLOCK: [2025-07-19 Sat 13:16]--[2025-07-19 Sat 13:17] =>  0:01
:END:
#+begin_src elisp :tangle yes
  (defun seq-take-right (n seq)    
      (funcall (-compose (-rpartial #'seq-take n) #'seq-reverse) seq))
#+end_src
***** DONE seq-take-last
CLOSED: [2025-07-23 Wed 08:32]
:LOGBOOK:
CLOCK: [2025-07-21 Mon 20:33]--[2025-07-21 Mon 20:34] =>  0:01
:END:
#+begin_src elisp :tangle yes
  (defun seq-take-last (n seq)    
    (funcall (-compose (apply-partially #'seq-subseq seq)  (-applify #'-)  #'nreverse (apply-partially #'list n) #'seq-length) seq))
#+end_src

***** DONE seq-shuffle
CLOSED: [2025-07-23 Wed 05:33]
****** DONE base implementation
CLOSED: [2025-07-23 Wed 05:22]
:LOGBOOK:
CLOCK: [2025-07-23 Wed 05:12]--[2025-07-23 Wed 05:22] =>  0:10
CLOCK: [2025-07-23 Wed 02:38]--[2025-07-23 Wed 02:45] =>  0:07
CLOCK: [2025-07-01 Tue 01:49]--[2025-07-01 Tue 01:56] =>  0:07
CLOCK: [2025-06-30 Mon 23:54]--[2025-07-01 Tue 00:30] =>  0:36
:END:
#+begin_src elisp :tangle yes
  (cl-defgeneric seq-shuffle (seq)
    (shuffle-list seq))
#+end_src
****** DONE for vectors
CLOSED: [2025-07-23 Wed 05:27]
:LOGBOOK:
CLOCK: [2025-07-23 Wed 05:25]--[2025-07-23 Wed 05:26] =>  0:01
:END:
#+begin_src elisp :tangle yes
  (cl-defmethod seq-shuffle ((seq vector))
     (funcall (-compose #'seq--into-vector #'shuffle-list #'seq--into-list) seq))
#+end_src
****** DONE for strings
CLOSED: [2025-07-23 Wed 05:30]
:LOGBOOK:
CLOCK: [2025-07-23 Wed 05:29]--[2025-07-23 Wed 05:30] =>  0:01
:END:
#+begin_src elisp :tangle yes
  (cl-defmethod seq-shuffle ((seq string))
     (funcall (-compose #'seq--into-string #'shuffle-list #'seq--into-list) seq))
#+end_src

***** DONE seq-n-random-values
CLOSED: [2025-07-24 Thu 00:26]
:LOGBOOK:
CLOCK: [2025-07-23 Wed 07:11]--[2025-07-23 Wed 07:13] =>  0:02
CLOCK: [2025-07-22 Tue 22:23]--[2025-07-22 Tue 22:23] =>  0:00
CLOCK: [2025-07-22 Tue 20:41]--[2025-07-22 Tue 20:47] =>  0:06
CLOCK: [2025-07-08 Tue 21:57]--[2025-07-08 Tue 21:57] =>  0:00
CLOCK: [2025-07-07 Mon 22:25]--[2025-07-07 Mon 22:27] =>  0:02
CLOCK: [2025-07-07 Mon 22:25]--[2025-07-07 Mon 22:25] =>  0:00
:END:
#+begin_src elisp :tangle yes
  (defun seq-n-random-values (count seq)
    (funcall (-compose (-rpartial #'seq-take count) #'seq-shuffle) seq))
#+end_src

***** DONE seq-one-random-value
CLOSED: [2025-07-24 Thu 00:32]
:LOGBOOK:
CLOCK: [2025-07-24 Thu 00:28]--[2025-07-24 Thu 00:32] =>  0:04
CLOCK: [2025-07-24 Thu 00:28]--[2025-07-24 Thu 00:28] =>  0:00
CLOCK: [2025-07-24 Thu 00:26]--[2025-07-24 Thu 00:26] =>  0:00
CLOCK: [2025-07-08 Tue 22:01]--[2025-07-08 Tue 22:02] =>  0:01
CLOCK: [2025-07-05 Sat 08:32]--[2025-07-05 Sat 08:34] =>  0:02
CLOCK: [2025-07-05 Sat 06:46]--[2025-07-05 Sat 07:02] =>  0:16
:END:
#+begin_src elisp :tangle yes
  (defalias 'seq-one-random-value (apply-partially #'seq-n-random-values 1))
#+end_src
***** DONE seq-two-random-values
CLOSED: [2025-07-08 Tue 22:12]
:LOGBOOK:
CLOCK: [2025-07-08 Tue 22:06]--[2025-07-08 Tue 22:07] =>  0:01
:END:
#+begin_src elisp :tangle yes
  (defalias 'seq-two-random-values (apply-partially #'seq-n-random-values 2))
#+end_src

***** DONE seq-random-chunk-length
CLOSED: [2025-07-22 Tue 20:41]
:PROPERTIES:
:ID:       b4a50ccc-58c0-4987-97b4-24962bafc837
:END:
:LOGBOOK:
CLOCK: [2025-07-22 Tue 20:41]--[2025-07-22 Tue 20:41] =>  0:00
CLOCK: [2025-07-22 Tue 20:40]--[2025-07-22 Tue 20:41] =>  0:01
CLOCK: [2025-07-19 Sat 13:53]--[2025-07-19 Sat 13:53] =>  0:00
:END:
#+begin_src elisp :tangle yes
(defalias 'seq-random-chunk-length (-compose #'random-integer-in-range-from-one  #'seq-length))
#+end_src

***** DONE seq-random-values
CLOSED: [2025-07-24 Thu 02:46]
:LOGBOOK:
CLOCK: [2025-07-24 Thu 02:41]--[2025-07-24 Thu 02:42] =>  0:01
CLOCK: [2025-07-24 Thu 00:36]--[2025-07-24 Thu 00:40] =>  0:02
CLOCK: [2025-07-24 Thu 00:34]--[2025-07-24 Thu 00:36] =>  0:02
:END:
#+begin_src elisp :tangle yes
  (defun seq-random-values (seq)
      (funcall (-compose (-rpartial #'seq-n-random-values seq) #'seq-random-chunk-length) seq))
#+end_src

***** DONE seq-random-iterate-from-max
CLOSED: [2025-07-25 Fri 00:36]
:LOGBOOK:
CLOCK: [2025-07-25 Fri 00:36]--[2025-07-25 Fri 00:36] =>  0:00
CLOCK: [2025-07-25 Fri 00:30]--[2025-07-25 Fri 00:31] =>  0:01
CLOCK: [2025-07-24 Thu 07:40]--[2025-07-24 Thu 07:45] =>  0:05
CLOCK: [2025-07-24 Thu 07:36]--[2025-07-24 Thu 07:38] =>  0:02
CLOCK: [2025-07-24 Thu 04:34]--[2025-07-24 Thu 04:35] =>  0:01
:END:
****** DONE base
CLOSED: [2025-07-24 Thu 07:49]
#+begin_src elisp :tangle yes
  (cl-defgeneric seq-random-iterate-from-max (seq)    
    (funcall (-compose #'-applify-iterate-plus-one #'seq-max-plus-one-and-random-chunk-length) seq))  
#+end_src
****** DONE vectors
CLOSED: [2025-07-24 Thu 07:49]
#+begin_src elisp :tangle yes
  (cl-defmethod seq-random-iterate-from-max ((seq vector))    
    (funcall (-compose #'seq--into-vector #'-applify-iterate-plus-one #'seq-max-plus-one-and-random-chunk-length) seq))  
#+end_src
****** DONE string
CLOSED: [2025-07-24 Thu 07:49]
#+begin_src elisp :tangle yes
  (cl-defmethod seq-random-iterate-from-max ((seq string))    
    (funcall (-compose #'seq--into-string #'-applify-iterate-plus-one #'seq-max-plus-one-and-random-chunk-length) seq))  
#+end_src
***** TODO seq-subsetp
:LOGBOOK:
CLOCK: [2025-07-22 Tue 20:30]--[2025-07-22 Tue 20:31] =>  0:01
:END:
****** DONE base
CLOSED: [2025-07-24 Thu 07:53]
#+begin_src elisp :tangle yes
  (cl-defgeneric seq-subsetp (seq-one seq-two)
      (cl-subsetp seq-one seq-two))
#+end_src
****** DONE vector
CLOSED: [2025-07-25 Fri 00:36]
:LOGBOOK:
CLOCK: [2025-07-25 Fri 00:16]--[2025-07-25 Fri 00:19] =>  0:03
:END:
#+begin_src elisp :tangle yes
  (cl-defmethod seq-subsetp ((seq-one vector) seq-two)
    (funcall (-compose #'-applify-cl-subsetp  #'seq-map-seq--into-list) (list seq-one seq-two)))
#+end_src
****** DONE string
CLOSED: [2025-07-25 Fri 08:43]
:LOGBOOK:
CLOCK: [2025-07-25 Fri 08:40]--[2025-07-25 Fri 08:43] =>  0:03
CLOCK: [2025-07-25 Fri 08:28]--[2025-07-25 Fri 08:35] =>  0:07
CLOCK: [2025-07-25 Fri 06:35]--[2025-07-25 Fri 06:41] =>  0:06
:END:
#+begin_src elisp :tangle yes
  (cl-defmethod seq-subsetp ((seq-one string) seq-two)
    (s-contains? seq-one seq-two nil))
#+end_src

***** DONE seq-random-chunk-of-size-n
CLOSED: [2025-07-25 Fri 06:52]
:LOGBOOK:
CLOCK: [2025-07-25 Fri 01:27]--[2025-07-25 Fri 01:29] =>  0:02
CLOCK: [2025-07-25 Fri 01:18]--[2025-07-25 Fri 01:23] =>  0:05
CLOCK: [2025-07-21 Mon 22:43]--[2025-07-21 Mon 22:43] =>  0:00
:END:
#+begin_src elisp :tangle yes
  (defun seq-random-chunk-of-size-n (chunk-length seq)
    (funcall (-compose #'-first-item  #'seq-one-random-value #'seq-split) seq chunk-length))
   (defalias '-applify-seq-random-chunk-of-size-n (-applify #'seq-random-chunk-of-size-n))  
#+end_src
***** DONE seq-random-chunk
CLOSED: [2025-07-25 Fri 08:43]
:LOGBOOK:
CLOCK: [2025-07-25 Fri 08:24]--[2025-07-25 Fri 08:25] =>  0:01
CLOCK: [2025-07-25 Fri 06:52]--[2025-07-25 Fri 06:55] =>  0:03
:END:
#+begin_src elisp :tangle yes
  (defalias 'seq-random-chunk (-compose #'-applify-seq-random-chunk-of-size-n (-juxt #'seq-random-chunk-length #'identity)))
#+end_src



** Testing 
*** DONE ert-deftest-times-macro
#+begin_src elisp :tangle yes
  ;; test-runner
  ;; needs a test
  (defmacro ert-deftest-n-times (name runs body)
    (declare (indent 2))
    (let ((fun-sym (gensym "test")))
      `(ert-deftest ,name ()
         (let ((,fun-sym (lambda (x) (progn
  				     ,body 1))))  			 
  	(times ,fun-sym ,runs)))))

#+end_src

#+RESULTS:
: ert-deftest-n-times

