quickcheck.el

(defun random-integer-list (length)    
  (funcall (-compose #'seq-shuffle #'-iterate-plus-one) (math-random-three-digit-number) length))  
(defalias 'random-integer-list-in-range-255 (-compose #'random-integer-list #'random-integer-in-range-255))

(defun random-integer-range (length)    
  (funcall (-juxt #'identity (apply-partially #'+ length))
	   (math-random-three-digit-number)))

(defalias 'divide-by-random-value (funcall (-compose #'-applify-rpartial (apply-partially #'list #'/) (-compose #'float #'random-integer-in-range-255))))

(defalias 'divide-array-values-by-random-value (apply-partially #'mapcar #'divide-by-random-value))

(defalias 'seq-count-integers (apply-partially #'seq-count #'integerp))
(defalias 'seq-count-floats (apply-partially #'seq-count #'floatp))
(defalias 'seq-count-strings (apply-partially #'seq-count #'stringp))  
(defalias 'seq-count-cons (apply-partially #'seq-count #'consp))

(defalias 'seq-count-between-zero-and-one (apply-partially #'seq-count #'between-zero-and-one))
(defalias 'seq-count-greater-than-or-equal-one (apply-partially #'seq-count #'greater-than-or-equal-one))

(defalias 'seq-map-add-one (apply-partially #'seq-map #'1+))
(defalias 'seq-map-length (apply-partially #'seq-map #'seq-length))
(defalias 'seq-sum-map-length (-compose #'-sum #'seq-map-length))

(defalias 'seq-map-seq--into-list (apply-partially #'seq-map #'seq--into-list))
(defalias 'seq-max-plus-one (-compose #'1+ #'seq-max))
(defalias 'seq-max-plus-one-and-random-chunk-length (-juxt #'seq-max-plus-one  #'seq-random-chunk-length))

(defun seq-take-right (n seq)    
    (funcall (-compose (-rpartial #'seq-take n) #'seq-reverse) seq))

(defun seq-take-last (n seq)    
  (funcall (-compose (apply-partially #'seq-subseq seq)  (-applify #'-)  #'nreverse (apply-partially #'list n) #'seq-length) seq))

(cl-defgeneric seq-shuffle (seq)
  (shuffle-list seq))

(cl-defmethod seq-shuffle ((seq vector))
   (funcall (-compose #'seq--into-vector #'shuffle-list #'seq--into-list) seq))

(cl-defmethod seq-shuffle ((seq string))
   (funcall (-compose #'seq--into-string #'shuffle-list #'seq--into-list) seq))

(defun seq-n-random-values (count seq)
  (funcall (-compose (-rpartial #'seq-take count) #'seq-shuffle) seq))

(defalias 'seq-one-random-value (apply-partially #'seq-n-random-values 1))

(defalias 'seq-two-random-values (apply-partially #'seq-n-random-values 2))

(defalias 'seq-random-chunk-length (-compose #'random-integer-in-range-from-one  #'seq-length))

(defun seq-random-values (seq)
    (funcall (-compose (-rpartial #'seq-n-random-values seq) #'seq-random-chunk-length) seq))

(cl-defgeneric seq-random-iterate-from-max (seq)    
  (funcall (-compose #'-applify-iterate-plus-one #'seq-max-plus-one-and-random-chunk-length) seq))

(cl-defmethod seq-random-iterate-from-max ((seq vector))    
  (funcall (-compose #'seq--into-vector #'-applify-iterate-plus-one #'seq-max-plus-one-and-random-chunk-length) seq))

(cl-defmethod seq-random-iterate-from-max ((seq string))    
  (funcall (-compose #'seq--into-string #'-applify-iterate-plus-one #'seq-max-plus-one-and-random-chunk-length) seq))

(cl-defgeneric seq-subsetp (seq-one seq-two)
    (cl-subsetp seq-one seq-two))

(cl-defmethod seq-subsetp ((seq-one vector) seq-two)
  (funcall (-compose #'-applify-cl-subsetp  #'seq-map-seq--into-list) (list seq-one seq-two)))

(cl-defmethod seq-subsetp ((seq-one string) seq-two)
  (s-contains? seq-one seq-two nil))

(defun seq-random-chunk-of-size-n (chunk-length seq)
  (funcall (-compose #'-first-item  #'seq-one-random-value #'seq-split) seq chunk-length))
 (defalias '-applify-seq-random-chunk-of-size-n (-applify #'seq-random-chunk-of-size-n))

(defalias 'seq-random-chunk (-compose #'-applify-seq-random-chunk-of-size-n (-juxt #'seq-random-chunk-length #'identity)))

;; test-runner
;; needs a test
(defmacro ert-deftest-n-times (name runs body)
  (declare (indent 2))
  (let ((fun-sym (gensym "test")))
    `(ert-deftest ,name ()
       (let ((,fun-sym (lambda (x) (progn
				     ,body 1))))  			 
	(times ,fun-sym ,runs)))))
