quickcheck.org
*** DONE generate-test-data
CLOSED: [2025-07-08 Tue 23:41]
:LOGBOOK:
CLOCK: [2025-07-02 Wed 06:28]--[2025-07-02 Wed 06:39] =>  0:11
CLOCK: [2025-07-02 Wed 05:16]--[2025-07-02 Wed 05:42] =>  0:26
CLOCK: [2025-07-02 Wed 04:04]--[2025-07-02 Wed 04:29] =>  0:25
CLOCK: [2025-07-01 Tue 21:38]--[2025-07-01 Tue 22:04] =>  0:26
CLOCK: [2025-07-01 Tue 05:21]--[2025-07-01 Tue 05:36] =>  0:15
CLOCK: [2025-07-01 Tue 01:56]--[2025-07-01 Tue 01:59] =>  0:03
CLOCK: [2025-06-30 Mon 21:21]--[2025-06-30 Mon 21:21] =>  0:00
CLOCK: [2025-06-30 Mon 21:08]--[2025-06-30 Mon 21:11] =>  0:03
:END:
***** DONE base function
CLOSED: [2025-07-02 Wed 06:39]
#+begin_src elisp :tangle yes
  (cl-defun generate-test-data (&optional &key item-transformer &key list-transformer
  				     &key min-length &key max-length)
    (let* ((min-items (or min-length 1))
  	 (max-items (or max-length 255))
  	 (item-func (or item-transformer #'identity))
  	 (list-func (or list-transformer #'seq-shuffle))
  	 (range-length (random-integer-in-range (list min-items max-items)))
  	 (list-items (random-integer-list range-length)))
      (funcall (-on list-func (apply-partially #'mapcar item-func)) list-items)))
#+end_src
***** DONE aliases for generate-test-data
CLOSED: [2025-07-08 Tue 23:41]
:LOGBOOK:
CLOCK: [2025-07-08 Tue 23:36]--[2025-07-08 Tue 23:41] =>  0:05
CLOCK: [2025-07-08 Tue 23:36]--[2025-07-08 Tue 23:36] =>  0:00
CLOCK: [2025-07-08 Tue 22:07]--[2025-07-08 Tue 22:19] =>  0:12
CLOCK: [2025-07-08 Tue 22:03]--[2025-07-08 Tue 22:06] =>  0:03
CLOCK: [2025-07-07 Mon 22:17]--[2025-07-07 Mon 22:19] =>  0:02
CLOCK: [2025-07-07 Mon 22:07]--[2025-07-07 Mon 22:13] =>  0:06
CLOCK: [2025-07-07 Mon 19:27]--[2025-07-07 Mon 19:29] =>  0:02
CLOCK: [2025-07-04 Fri 06:10]--[2025-07-04 Fri 06:17] =>  0:07
CLOCK: [2025-07-04 Fri 03:30]--[2025-07-04 Fri 03:30] =>  0:00
CLOCK: [2025-07-03 Thu 16:38]--[2025-07-03 Thu 17:15] =>  0:37
CLOCK: [2025-07-03 Thu 07:07]--[2025-07-03 Thu 07:31] =>  0:24
CLOCK: [2025-07-03 Thu 06:21]--[2025-07-03 Thu 06:33] =>  0:12
:END:
#+begin_src elisp :tangle yes

  (defalias 'generate-test-list-of-integers #'generate-test-data)
  
  (defalias 'generate-test-list-of-floats-between-zero-and-one (apply-partially #'generate-test-data :list-transformer (-compose #'divide-array-values-by-max-array-value #'seq-shuffle)))
  (defalias 'generate-test-list-of-floats (apply-partially #'generate-test-data :list-transformer (-compose #'divide-array-values-by-random-value #'seq-shuffle)))
  (defalias 'generate-test-list-of-strings (apply-partially #'generate-test-data :item-transformer #'char-to-string))

  (defalias 'generate-test-string (apply-partially #'generate-test-data :item-transformer #'identity :min-length 2 :list-transformer (-compose #'seq--into-string #'seq-shuffle)))


  (defalias 'generate-test-vector-of-integers (apply-partially #'generate-test-data :list-transformer (-compose #'seq--into-vector #'seq-shuffle)))


  (defalias 'generate-test-alist-of-integers (apply-partially #'generate-test-data :list-transformer (-compose #'-applify-zip (-juxt #'reverse #'seq-shuffle))))


  (defalias 'generate-test-con-of-integers (apply-partially #'generate-test-data :min-length 2 :list-transformer #'random-con-from-array))  
  (defalias 'generate-test-con-of-floats (apply-partially #'generate-test-data :min-length 2 :list-transformer (-compose #'random-con-from-array #'divide-array-values-by-max-array-value)))
  (defalias 'generate-test-con-of-strings (apply-partially #'generate-test-data :min-length 2 :item-transformer #'char-to-string :list-transformer #'random-con-from-array))

#+end_src

#+RESULTS:



** generics for quickcheck
:LOGBOOK:
CLOCK: [2025-07-11 Fri 04:11]--[2025-07-11 Fri 04:17] =>  0:06
CLOCK: [2025-06-22 Sun 18:12]--[2025-06-22 Sun 18:40] =>  0:28
CLOCK: [2025-06-22 Sun 16:04]--[2025-06-22 Sun 16:40] =>  0:36
CLOCK: [2025-06-22 Sun 14:18]--[2025-06-22 Sun 14:44] =>  0:26
CLOCK: [2025-06-22 Sun 12:11]--[2025-06-22 Sun 12:38] =>  0:27
CLOCK: [2025-06-21 Sat 12:14]--[2025-06-21 Sat 12:40] =>  0:26
CLOCK: [2025-06-22 Sun 22:34]--[2025-06-22 Sun 23:17] =>  0:43
:END:
*** Semigroup
:LOGBOOK:
CLOCK: [2025-07-08 Tue 23:42]--[2025-07-08 Tue 23:52] =>  0:10
:END:
**** Laws to test 
- [1,2,3] <> [4,5,6]  -- [1,2,3,4,5,6]
- (<>) :: a -> a -> a
**** semigroup-concat
:LOGBOOK:
CLOCK: [2025-07-11 Fri 06:00]--[2025-07-11 Fri 06:12] =>  0:12
:END:
#+begin_src emacs-lisp :tangle yes
  (cl-defgeneric semigroup-concat (a b)
    (concat a b))
#+end_src
***** DONE for lists
CLOSED: [2025-07-21 Mon 20:23]
:LOGBOOK:
CLOCK: [2025-07-11 Fri 07:50]--[2025-07-11 Fri 07:55] =>  0:05
:END:
#+begin_src emacs-lisp :tangle yes
  (cl-defmethod semigroup-concat ((a list) b)
    (append a b))

#+end_src
***** DONE for vectors
CLOSED: [2025-07-21 Mon 20:35]
:LOGBOOK:
CLOCK: [2025-07-21 Mon 20:26]--[2025-07-21 Mon 20:30] =>  0:04
CLOCK: [2025-07-21 Mon 20:20]--[2025-07-21 Mon 20:22] =>  0:02
CLOCK: [2025-07-11 Fri 07:55]--[2025-07-11 Fri 07:55] =>  0:00
:END:
#+begin_src emacs-lisp :tangle yes
  (cl-defmethod semigroup-concat ((a vector) b)
    (vconcat a b))

#+end_src

**** stimes
- stimes :: Integral b => b -> a -> a 
:LOGBOOK:
CLOCK: [2025-07-21 Mon 20:35]--[2025-07-21 Mon 20:36] =>  0:01
:END:
#+begin_src haskell :results value
  import Data.Semigroup (stimes)
   stimes 4 "earl"
#+end_src

#+RESULTS:


*** TODO Monoid
*** TODO Functor
- https://hackage.haskell.org/package/ghc-internal-9.1201.0/docs/src/GHC.Internal.Base.html#local-6989586621679720736
**** TODO deftype for cl-constantly
#+begin_src emacs-lisp :tangle yes
;;  (cl-deftype)
#+end_src
**** TODO fmap 
:LOGBOOK:
CLOCK: [2025-07-02 Wed 08:47]--[2025-07-02 Wed 09:04] =>  0:17
:END:
***** DONE base fmap
CLOSED: [2025-07-02 Wed 09:00]
#+begin_src emacs-lisp :tangle yes

  
#+end_src
***** DONE fmap for lists
CLOSED: [2025-07-02 Wed 09:01]
#+begin_src emacs-lisp :tangle yes
(cl-defmethod fmap (function (functor list))
    (seq-map function functor))
#+end_src
***** TODO fmap for vectors
#+begin_SRC emacs-lisp :tangle yes
(cl-defmethod fmap (function (functor vector))
     (seq--into-vector (funcall (-compose #'seq-map function) functor)))
#+end_src
***** TODO fmap for strings
#+begin_SRC emacs-lisp :tangle yes

#+end_src

***** TODO fmap for cons
#+begin_SRC emacs-lisp :tangle yes

#+end_src


**** TODO <$
- (<$) :: a -> [b] -> [a]
- "a" <$ "earl" :: [String]
:LOGBOOK:
CLOCK: [2025-07-02 Wed 08:14]--[2025-07-02 Wed 08:41] =>  0:27
CLOCK: [2025-07-02 Wed 07:42]--[2025-07-02 Wed 08:10] =>  0:28
CLOCK: [2025-07-02 Wed 06:39]--[2025-07-02 Wed 06:53] =>  0:14
:END:
***** TODO <$ for strings, vectors, lists
#+begin_SRC emacs-lisp :tangle yes
(defun <$ (a fb)
    (let ((func (funcall (-compose #'partial-fmap #'cl-constantly) a)))
      (funcall func fb)))

#+END_SRC
***** TODO <$ for cons

***** TODO <$ for constants

*** TODO Applicative
- https://hackage.haskell.org/package/ghc-internal-9.1201.0/docs/src/GHC.Internal.Base.html#local-6989586621679720736
**** TODO pure 
#+BEGIN_SRC emacs-lisp :tangle yes
;;(pure "x" list)
#+END_SRC
**** TODO <*>
-[(+2),(+1)]<*>[1,2,3] 
-[3,4,5,2,3,4]
#+BEGIN_SRC emacs-lisp :tangle yes
;;(pure "x" list)
#+END_SRC
**** TODO liftA2
#+BEGIN_SRC emacs-lisp :tangle yes
;;(pure "x" list)
#+END_SRC

*** WAITING Monad
- https://hackage.haskell.org/package/ghc-internal-9.1201.0/docs/src/GHC.Internal.Base.html#local-6989586621679720736
#+BEGIN_SRC emacs-lisp :tangle yes


#+END_SRC
**** WAITING State Monad
- https://hackage.haskell.org/package/mtl-2.3.1/docs/src/Control.Monad.State.Class.html#MonadState



** WAITING std-gen
- https://hackage-content.haskell.org/package/random-1.3.1/docs/System-Random-Stateful.html
- https://hackage-content.haskell.org/package/random-1.3.1/docs/src/System.Random.Internal.html#genWord32
#+BEGIN_SRC emacs-lisp :tangle yes


#+END_SRC

** WAITING random.hs
- https://github.com/nick8325/quickcheck/blob/246943ea0049434c5ec0d5162e7581441e65c904/src/Test/QuickCheck/Random.hs
:LOGBOOK:
CLOCK: [2025-06-12 Thu 17:03]--[2025-06-12 Thu 17:15] =>  0:12
CLOCK: [2025-06-11 Wed 09:09]--[2025-06-11 Wed 09:23] =>  0:14
CLOCK: [2025-06-11 Wed 04:52]--[2025-06-11 Wed 05:12] =>  0:20
:END:


**** DONE qc-gen
CLOSED: [2025-06-18 Wed 13:20]
:LOGBOOK:
CLOCK: [2025-06-20 Fri 15:40]--[2025-06-20 Fri 15:54] =>  0:14
CLOCK: [2025-06-18 Wed 13:17]--[2025-06-18 Wed 13:20] =>  0:03
CLOCK: [2025-06-18 Wed 11:27]--[2025-06-18 Wed 11:46] =>  0:19
CLOCK: [2025-06-18 Wed 11:27]--[2025-06-18 Wed 11:27] =>  0:00
CLOCK: [2025-06-17 Tue 11:07]--[2025-06-17 Tue 11:18] =>  0:11
CLOCK: [2025-06-17 Tue 09:44]--[2025-06-17 Tue 10:11] =>  0:27
CLOCK: [2025-06-17 Tue 07:55]--[2025-06-17 Tue 08:22] =>  0:27
CLOCK: [2025-06-16 Mon 08:31]--[2025-06-16 Mon 08:59] =>  0:28
CLOCK: [2025-06-16 Mon 04:56]--[2025-06-16 Mon 05:16] =>  0:20
CLOCK: [2025-06-16 Mon 03:16]--[2025-06-16 Mon 03:36] =>  0:20
CLOCK: [2025-06-16 Mon 01:18]--[2025-06-16 Mon 01:45] =>  0:27
CLOCK: [2025-06-15 Sun 00:02]--[2025-06-15 Sun 00:39] =>  0:37
CLOCK: [2025-06-14 Sat 22:33]--[2025-06-14 Sat 22:59] =>  0:26
CLOCK: [2025-06-14 Sat 20:50]--[2025-06-14 Sat 21:16] =>  0:26
CLOCK: [2025-06-13 Fri 18:47]--[2025-06-13 Fri 19:13] =>  0:26
CLOCK: [2025-06-13 Fri 16:57]--[2025-06-13 Fri 17:23] =>  0:26
CLOCK: [2025-06-13 Fri 15:21]--[2025-06-13 Fri 15:57] =>  0:36
CLOCK: [2025-06-13 Fri 13:57]--[2025-06-13 Fri 14:25] =>  0:28
CLOCK: [2025-06-13 Fri 11:28]--[2025-06-13 Fri 11:55] =>  0:27
:END:
#+begin_src elisp :tangle yes
  ;; renames StdGen QcGen
  ;; newtype QCGen = QCGen StdGen
  ;; StdGen is renamed QCGen
  ;; Then Show, Read, RandomGen instances are rewritten
  ;; showPrec
  ;; readPrec
  ;; genRange
  ;; next

#+END_SRC

**** WAITING read-seed
#+begin_src elisp :tangle yes
  ;; declare pure?

#+END_SRC

**** WAITING show-seed
#+begin_src elisp :tangle yes
  ;; declare pure?
  ;; showsPrec n (QCGen g) s = showsPrec n g s

#+END_SRC

**** WAITING next-int
#+begin_src elisp :tangle yes

#+END_SRC
**** WAITING next-double
#+begin_src elisp :tangle yes

#+END_SRC


**** WAITING next-integer
#+begin_src elisp :tangle yes

#+END_SRC

** WAITING gen.hs
:LOGBOOK:
CLOCK: [2025-06-20 Fri 15:31]--[2025-06-20 Fri 15:40] =>  0:09
CLOCK: [2025-06-20 Fri 13:50]--[2025-06-20 Fri 14:16] =>  0:26
CLOCK: [2025-06-20 Fri 10:08]--[2025-06-20 Fri 10:33] =>  0:25
CLOCK: [2025-06-18 Wed 15:34]--[2025-06-18 Wed 15:45] =>  0:00
CLOCK: [2025-06-18 Wed 13:20]--[2025-06-18 Wed 13:46] =>  0:26
CLOCK: [2025-06-18 Wed 11:08]--[2025-06-18 Wed 11:27] =>  0:19
CLOCK: [2025-06-18 Wed 09:25]--[2025-06-18 Wed 09:53] =>  0:28
CLOCK: [2025-06-18 Wed 07:23]--[2025-06-18 Wed 07:49] =>  0:26
CLOCK: [2025-06-17 Tue 11:18]--[2025-06-17 Tue 11:34] =>  0:16
CLOCK: [2025-06-12 Thu 13:52]--[2025-06-12 Thu 13:52] =>  0:00
CLOCK: [2025-06-11 Wed 14:12]--[2025-06-11 Wed 14:38] =>  0:26
CLOCK: [2025-06-11 Wed 12:23]--[2025-06-11 Wed 12:59] =>  0:36
CLOCK: [2025-06-11 Wed 10:48]--[2025-06-11 Wed 11:16] =>  0:28
CLOCK: [2025-06-11 Wed 09:24]--[2025-06-11 Wed 09:30] =>  0:06
:END:
- https://github.com/nick8325/quickcheck/blob/246943ea0049434c5ec0d5162e7581441e65c904/src/Test/QuickCheck/Random.hs
#+begin_src elisp :tangle yes
  ;; newtype Age = Age { unAge:: Int}
  ;; constructor
  ;; Age :: Int -> Age
  ;; deconstructor
  ;; unAge :: Age -> Int

  ;; newtype Gen a = MkGen{ unGen :: QCGen -> Int -> a}
  ;; constructor
  ;; Gen a :: a -> Gen a
  ;; deconstructor
  ;; unGen ::  Gen a -> QCGen -> Int -> a
  ;; unGen -> 
  ;; To get a value out generate :: Gen a -> IO a

#+end_src

**** waiting un-gen
#+begin_src elisp :tangle yes
#+end_src
**** WAITING gen-fmap
#+begin_src elisp :tangle yes

#+END_SRC
**** WAITING gen-applicative
#+begin_src elisp :tangle yes

#+end_src

**** WAITING gen-monad
#+begin_src elisp :tangle yes

#+end_src

**** WAITING gen-sequencer ">>"
#+begin_src elisp :tangle yes

#+END_SRC

**** WAITING gen-monad-fix
#+begin_src elisp :tangle yes

#+END_SRC

**** WAITING choose-integer
**** WAITING choose-enum is generic for lists, vectors, alist, plist, and eventually hash-maps


** Long Term
*** check map.el for mapped types
*** eldev
*** Test result via evaluation of org-mode
** Cancelled 
*** CANCELLED Test and write qc-gen
CLOSED: [2025-06-09 Mon 02:44]
:LOGBOOK:
CLOCK: [2025-06-09 Mon 02:27]--[2025-06-09 Mon 02:44] =>  0:17
CLOCK: [2025-06-09 Mon 00:40]--[2025-06-09 Mon 01:08] =>  0:28
CLOCK: [2025-06-08 Sun 22:58]--[2025-06-08 Sun 23:34] =>  0:36
CLOCK: [2025-06-08 Sun 21:37]--[2025-06-08 Sun 22:04] =>  0:27
CLOCK: [2025-06-08 Sun 20:06]--[2025-06-08 Sun 20:32] =>  0:26
:END:

*** CANCELLED Test and write qc-integer
:LOGBOOK:
CLOCK: [2025-06-09 Mon 02:44]--[2025-06-09 Mon 02:53] =>  0:09
:END:
