quickcheck.org
*** CANCELLED wrap-std-gen
:LOGBOOK:
CLOCK: [2025-06-12 Thu 16:50]--[2025-06-12 Thu 17:03] =>  0:13
CLOCK: [2025-06-12 Thu 13:52]--[2025-06-12 Thu 14:18] =>  0:26
CLOCK: [2025-06-11 Wed 09:05]--[2025-06-11 Wed 09:09] =>  0:04
CLOCK: [2025-06-11 Wed 06:41]--[2025-06-11 Wed 07:08] =>  0:27
:END:
*** CANCELLED make-qc-gen


** End
#+begin_src elisp :tangle yes
  (provide 'quickcheck)
  ;;; quickcheck.el ends here
#+END_SRC

#+RESULTS:
: quickcheck
