quickcheck.el













(provide 'quickcheck)
;;; quickcheck.el ends here
